src/cf/InformationRegisters/ФактическиеТрудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФактическиеТрудозатраты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьВВыходные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьСверхурочно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйОтчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДобавления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроектнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/УчетВремениВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Учет времени (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает фактические работы на дату по Сотруднику
//	
Функция ПолучитьРаботыЗаДень(Дата, Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическиеТрудозатраты.Сотрудник КАК Сотрудник,
	|	ФактическиеТрудозатраты.Источник КАК Источник,
	|	ФактическиеТрудозатраты.Проект КАК Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот КАК ВидРабот,
	|	ФактическиеТрудозатраты.ДатаДобавления КАК ДатаДобавления,
	|	ФактическиеТрудозатраты.Начало КАК Начало,
	|	ФактическиеТрудозатраты.Окончание КАК Окончание,
	|	ФактическиеТрудозатраты.Длительность КАК Длительность,
	|	ФактическиеТрудозатраты.ЕжедневныйОтчет КАК ЕжедневныйОтчет,
	|	ФактическиеТрудозатраты.ОписаниеРаботы КАК ОписаниеРаботы,
	|	ФактическиеТрудозатраты.НомерДобавления КАК НомерДобавленияИсходный
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.ДатаДобавления, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ)
	|	И ФактическиеТрудозатраты.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("ДатаОтчета", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Заполняет время начала и окончания дня в зависимости от настроек пользователя
//
Процедура ЗаполнитьНачалоИОкончаниеДня(Объект) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиРаботы") Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	ГрафикРаботы = ГрафикиРаботы.ГрафикРаботыСотрудника(Объект.Сотрудник);
	СтруктураВозврата = ГрафикиРаботы.ПолучитьНачалоИОкончаниеРабочегоДня(Объект.Дата, ГрафикРаботы);
	
	Если ЗначениеЗаполнено(СтруктураВозврата.НачалоДня) Тогда 
		Объект.НачалоДня = СтруктураВозврата.НачалоДня;
		Объект.НачалоДня = Объект.НачалоДня - Секунда(Объект.НачалоДня);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураВозврата.ОкончаниеДня) Тогда 
		Объект.ОкончаниеДня = СтруктураВозврата.ОкончаниеДня;
		Объект.ОкончаниеДня = Объект.ОкончаниеДня - Секунда(Объект.ОкончаниеДня);
	КонецЕсли;	
	
КонецПроцедуры	

// Переключить хронометраж.
// 
// Параметры:
//  Ссылка - см. РегистрСведений.ХронометражРабочегоВремениСотрудников.Объект
//  ПараметрыУчетаВремени - См. УчетВремениКлиентСервер.НовыйПараметрыУчетаВремени
// 
// Возвращаемое значение:
//  Структура:
//   * ПараметрыОповещения - Структура
//   * ПараметрыУчетаВремени - см. УчетВремениКлиентСервер.НовыйПараметрыУчетаВремени
// 
Функция ПереключитьХронометраж(Знач Ссылка, Знач ПараметрыУчетаВремени) Экспорт
	
	ПараметрыОповещения = Новый Структура;
	
	ПереключитьХронометражНеМеняяПодсказку = Новый Структура("Подсказка");
	ЭлементПереключитьХронометраж = Новый Структура("Пометка");
	УчетВремени.ПереключитьХронометражСервер(
		ПараметрыОповещения,
		ПараметрыУчетаВремени.ДатаНачалаХронометража,
		ПараметрыУчетаВремени.ДатаКонцаХронометража,
		ПараметрыУчетаВремени.ВключенХронометраж,
		Ссылка,
		ПараметрыУчетаВремени.ВидыРабот,
		ПереключитьХронометражНеМеняяПодсказку,
		ЭлементПереключитьХронометраж);
	
	НовыеПараметрыУчетаВремени = УчетВремениКлиентСервер.НовыйПараметрыУчетаВремени();
	НовыеПараметрыУчетаВремени.ДатаНачалаХронометража = ПараметрыУчетаВремени.ДатаНачалаХронометража;
	НовыеПараметрыУчетаВремени.ДатаКонцаХронометража = ПараметрыУчетаВремени.ДатаКонцаХронометража;
	НовыеПараметрыУчетаВремени.ВключенХронометраж = ПараметрыУчетаВремени.ВключенХронометраж;
	НовыеПараметрыУчетаВремени.ВидыРабот = ПараметрыУчетаВремени.ВидыРабот;
	НовыеПараметрыУчетаВремени.ЭлементПереключитьХронометражПометка = ЭлементПереключитьХронометраж.Пометка;
	
	РезультатПереключенияХронометража = Новый Структура;
	РезультатПереключенияХронометража.Вставить("ПараметрыОповещения", ПараметрыОповещения);
	РезультатПереключенияХронометража.Вставить("ПараметрыУчетаВремени", НовыеПараметрыУчетаВремени);
	
	Возврат РезультатПереключенияХронометража;
	
КонецФункции

#КонецОбласти
